# 10.1 GroupBy Mechanics

In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'key1':['a','a','b','b','a'],
                   'key2':['one','two','one','two','one'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.064231  1.632315
1    a  two -0.462025  0.677720
2    b  one -2.762297  1.684942
3    b  two -0.699751 -0.470284
4    a  one -0.187928  0.272061

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a   -0.238062
b   -1.731024
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one    -0.126080
      two    -0.462025
b     one    -2.762297
      two    -0.699751
Name: data1, dtype: float64

In [6]:
means.unstack()

key2       one       two
key1
a    -0.126080 -0.462025
b    -2.762297 -0.699751

In [7]:
states = np.array(['Ohio','California','California','Ohio','Ohio'])
years = np.array([2005,2005,2006,2005,2006])

df['data1'].groupby([states, years]).mean()

California  2005   -0.462025
            2006   -2.762297
Ohio        2005   -0.381991
            2006   -0.187928
Name: data1, dtype: float64

In [9]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.238062  0.860699
b    -1.731024  0.607329

In [10]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.126080  0.952188
     two  -0.462025  0.677720
b    one  -2.762297  1.684942
     two  -0.699751 -0.470284

In [11]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

## 10.1.1 Iterating Over Groups

In [12]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.064231  1.632315
1    a  two -0.462025  0.677720
4    a  one -0.187928  0.272061
b
  key1 key2     data1     data2
2    b  one -2.762297  1.684942
3    b  two -0.699751 -0.470284

In [13]:
for (k1,k2), group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.064231  1.632315
4    a  one -0.187928  0.272061
('a', 'two')
  key1 key2     data1    data2
1    a  two -0.462025  0.67772
('b', 'one')
  key1 key2     data1     data2
2    b  one -2.762297  1.684942
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.699751 -0.470284

In [14]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one -2.762297  1.684942
3    b  two -0.699751 -0.470284

In [15]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [17]:
grouped = df.groupby(df.dtypes, axis = 1)
grouped

In [20]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.064231  1.632315
1 -0.462025  0.677720
2 -2.762297  1.684942
3 -0.699751 -0.470284
4 -0.187928  0.272061
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

## 10.1.2 Selecting a Column or Subset of Columns

In [21]:
df.groupby('key1')['data1']

In [22]:
df.groupby('key1')[['data2']]

In [23]:
df['data1'].groupby(df['key1'])

In [24]:
df[['data2']].groupby(df['key1'])

In [25]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.952188
     two   0.677720
b    one   1.684942
     two  -0.470284

In [31]:
s_grouped = df.groupby(['key1','key2'])['data2']
s_grouped

In [32]:
s_grouped.mean()

key1  key2
a     one     0.952188
      two     0.677720
b     one     1.684942
      two    -0.470284
Name: data2, dtype: float64

## 10.1.3 Grouping with Dicts and Series

In [35]:
people = pd.DataFrame(np.random.randn(5,5),
                      columns = ['a','b','c','d','e'],
                      index = ['Joe','Steve','Wes','Jim','Travis'])
people

               a         b         c         d         e
Joe    -0.297808 -0.086334 -0.598911 -0.739206  0.210323
Steve  -1.419580 -2.443783  0.067507  0.448604  0.544940
Wes     1.403537  3.034599  0.540670 -0.134546 -0.352160
Jim     1.212372  0.137803 -1.544222  0.316644  1.062359
Travis -0.766783 -1.792256 -0.968399  0.568433  0.933309

In [36]:
people.iloc[2:3,[1,2]] = np.nan
people

               a         b         c         d         e
Joe    -0.297808 -0.086334 -0.598911 -0.739206  0.210323
Steve  -1.419580 -2.443783  0.067507  0.448604  0.544940
Wes     1.403537       NaN       NaN -0.134546 -0.352160
Jim     1.212372  0.137803 -1.544222  0.316644  1.062359
Travis -0.766783 -1.792256 -0.968399  0.568433  0.933309

In [37]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [38]:
by_column = people.groupby(mapping, axis = 1)
by_column.sum()

            blue       red
Joe    -1.338118 -0.173820
Steve   0.516112 -3.318423
Wes    -0.134546  1.051376
Jim    -1.227578  2.412534
Travis -0.399966 -1.625730

In [41]:
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [42]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [43]:
people.groupby(map_series, axis = 1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

## 10.1.4 Grouping with Functions

In [44]:
people.groupby(len).sum()

          a         b         c         d         e
3  2.318100  0.051469 -2.143133 -0.557109  0.920521
5 -1.419580 -2.443783  0.067507  0.448604  0.544940
6 -0.766783 -1.792256 -0.968399  0.568433  0.933309

In [45]:
people.groupby(len)

In [46]:
key_list = ['one','one','one','two','two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.297808 -0.086334 -0.598911 -0.739206 -0.352160
  two  1.212372  0.137803 -1.544222  0.316644  1.062359
5 one -1.419580 -2.443783  0.067507  0.448604  0.544940
6 two -0.766783 -1.792256 -0.968399  0.568433  0.933309

In [47]:
people

               a         b         c         d         e
Joe    -0.297808 -0.086334 -0.598911 -0.739206  0.210323
Steve  -1.419580 -2.443783  0.067507  0.448604  0.544940
Wes     1.403537       NaN       NaN -0.134546 -0.352160
Jim     1.212372  0.137803 -1.544222  0.316644  1.062359
Travis -0.766783 -1.792256 -0.968399  0.568433  0.933309

## 10.1.5 Grouping by Index Levels

In [48]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],
                                     [1,3,5,1,3]],
                                    names = ['cty','tenor'])
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           codes=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [49]:
hier_df = pd.DataFrame(np.random.randn(4,5), columns = columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -2.140836  0.877977  1.349519 -1.194381  0.826430
1      0.174968  0.691185  0.357229  1.124182  0.412766
2     -1.048207 -0.799845 -1.365667 -0.410738  1.074739
3      0.124938  0.353488  0.048392 -2.418462 -1.046500

In [50]:
hier_df.groupby(level = 'cty', axis = 1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [52]:
hier_df.groupby(level = 'tenor', axis = 1).count()

tenor  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

# 10.2 Data Aggregation

In [53]:
df

  key1 key2     data1     data2
0    a  one -0.064231  1.632315
1    a  two -0.462025  0.677720
2    b  one -2.762297  1.684942
3    b  two -0.699751 -0.470284
4    a  one -0.187928  0.272061

In [55]:
grouped = df.groupby('key1')
grouped

In [56]:
grouped['data1'].quantile(0.9)

key1
a   -0.088970
b   -0.906005
Name: data1, dtype: float64

In [57]:
grouped['data1'].quantile(0.5)

key1
a   -0.187928
b   -1.731024
Name: data1, dtype: float64

In [58]:
grouped['data1'].median()

key1
a   -0.187928
b   -1.731024
Name: data1, dtype: float64

In [59]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [60]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.397794  1.360254
b     2.062546  2.155226

In [62]:
grouped.agg(min)

     key2     data1     data2
key1
a     one -0.462025  0.272061
b     one -2.762297 -0.470284

In [63]:
grouped.min()

     key2     data1     data2
key1
a     one -0.462025  0.272061
b     one -2.762297 -0.470284

In [64]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.238062  0.203581 -0.462025 -0.324977 -0.187928 -0.126080
b      2.0 -1.731024  1.458440 -2.762297 -2.246661 -1.731024 -1.215387

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a    -0.064231   3.0  0.860699  0.698343  0.272061  0.474891  0.677720
b    -0.699751   2.0  0.607329  1.523975 -0.470284  0.068522  0.607329


           75%       max
key1
a     1.155018  1.632315
b     1.146135  1.684942

## 10.2.1 Column-Wise and Multiple Function Application

In [67]:
tips = pd.read_csv('/Users/boyuan/Desktop/OneDrive - Duke University/Data Science Box/Python/Python for data analysis 2nd/examples/tips.csv')
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [68]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [70]:
grouped = tips.groupby(['day','smoker'])
grouped

In [71]:
grouped_pct = grouped['tip_pct']

In [72]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [73]:
grouped_pct.agg(['mean','std',peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [76]:
grouped_pct.agg([('foo','mean'),('bar',np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [77]:
functions = ['count','mean','max']
result = grouped['tip_pct','total_bill'].agg(functions)
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [78]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [79]:
ftuples = [('Durchschnitt','mean'),('Abweichung',np.var)]
grouped['tip_pct','total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [80]:
grouped.agg({'tip':np.max, 'size':'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [81]:
grouped.agg({'tip_pct':['min','max','mean','std'], 'size':'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

## 10.2.2 Returning Aggregated Data Without Row Indexes

In [82]:
tips.groupby(['day','smoker'], as_index = False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

# 10.3 Apply: General split-apply-combine

In [83]:
def top(df, n = 5, column = 'tip_pct'):
    return df.sort_values(by = column)[-n:]

top(tips, n = 6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [84]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [86]:
tips.groupby(['smoker','day']).apply(top, n = 1, column = 'total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [87]:
result = tips.groupby('smoker')['tip_pct'].describe()
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [88]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [89]:
f = lambda x:x.describe()
grouped.apply(f)

                   total_bill        tip       size    tip_pct
day  smoker
Fri  No     count    4.000000   4.000000   4.000000   4.000000
            mean    18.420000   2.812500   2.250000   0.151650
            std      5.059282   0.898494   0.500000   0.028123
            min     12.460000   1.500000   2.000000   0.120385
            25%     15.100000   2.625000   2.000000   0.137239
            50%     19.235000   3.125000   2.000000   0.149241
            75%     22.555000   3.312500   2.250000   0.163652
            max     22.750000   3.500000   3.000000   0.187735
     Yes    count   15.000000  15.000000  15.000000  15.000000
            mean    16.813333   2.714000   2.066667   0.174783
            std      9.086388   1.077668   0.593617   0.051293
            min      5.750000   1.000000   1.000000   0.103555
            25%     11.690000   1.960000   2.000000   0.133739
            50%     13.420000   2.500000   2.000000   0.173913
            75%     18.665000   3.240000   2.000000   0.209240
            max     40.170000   4.730000   4.000000   0.263480
Sat  No     count   45.000000  45.000000  45.000000  45.000000
            mean    19.661778   3.102889   2.555556   0.158048
            std      8.939181   1.642088   0.784960   0.039767
            min      7.250000   1.000000   1.000000   0.056797
            25%     14.730000   2.010000   2.000000   0.136240
            50%     17.820000   2.750000   2.000000   0.150152
            75%     20.650000   3.390000   3.000000   0.183915
            max     48.330000   9.000000   4.000000   0.291990
     Yes    count   42.000000  42.000000  42.000000  42.000000
            mean    21.276667   2.875476   2.476190   0.147906
            std     10.069138   1.630580   0.862161   0.061375
            min      3.070000   1.000000   1.000000   0.035638
            25%     13.405000   2.000000   2.000000   0.091797
            50%     20.390000   2.690000   2.000000   0.153624
...                       ...        ...        ...        ...
Sun  No     std      8.130189   1.224785   1.032674   0.042347
            min      8.770000   1.010000   2.000000   0.059447
            25%     14.780000   2.000000   2.000000   0.139780
            50%     18.430000   3.020000   3.000000   0.161665
            75%     25.000000   3.920000   4.000000   0.185185
            max     48.170000   6.000000   6.000000   0.252672
     Yes    count   19.000000  19.000000  19.000000  19.000000
            mean    24.120000   3.516842   2.578947   0.187250
            std     10.442511   1.261151   0.901591   0.154134
            min      7.250000   1.500000   2.000000   0.065660
            25%     17.165000   3.000000   2.000000   0.097723
            50%     23.100000   3.500000   2.000000   0.138122
            75%     32.375000   4.000000   3.000000   0.215325
            max     45.350000   6.500000   5.000000   0.710345
Thur No     count   45.000000  45.000000  45.000000  45.000000
            mean    17.113111   2.673778   2.488889   0.160298
            std      7.721728   1.282964   1.179796   0.038774
            min      7.510000   1.250000   1.000000   0.072961
            25%     11.690000   1.800000   2.000000   0.137741
            50%     15.950000   2.180000   2.000000   0.153492
            75%     20.270000   3.000000   2.000000   0.184843
            max     41.190000   6.700000   6.000000   0.266312
     Yes    count   17.000000  17.000000  17.000000  17.000000
            mean    19.190588   3.030000   2.352941   0.163863
            std      8.355149   1.113491   0.701888   0.039389
            min     10.340000   2.000000   2.000000   0.090014
            25%     13.510000   2.000000   2.000000   0.148038
            50%     16.470000   2.560000   2.000000   0.153846
            75%     19.810000   4.000000   2.000000   0.194837
            max     43.110000   5.000000   4.000000   0.241255

[64 rows x 4 columns]

## 10.3.1 Suppressing the Group Keys

In [90]:
tips.groupby('smoker', group_keys = False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

## 10.3.2 Quantile and Bucket Analysis

In [91]:
frame = pd.DataFrame({'data1':np.random.randn(1000),
                      'data2':np.random.randn(1000)})
frame

        data1     data2
0    0.150052 -1.668021
1   -0.196588  0.464613
2    0.325299  0.791479
3    0.354162 -0.610964
4    0.560878 -0.618360
5   -0.100733 -0.633759
6   -1.652526  0.206614
7   -0.755922  0.514056
8    0.612231  0.875186
9    0.825884  0.144269
10   0.198923 -0.109442
11  -0.636580 -0.470575
12   0.549574 -0.540370
13   1.051708  0.526217
14  -3.003896 -0.007358
15   0.492904 -2.632239
16   0.500980  0.988394
17   0.155409 -0.254443
18   0.122233  0.929632
19  -0.082353  0.654188
20   0.701819  1.746147
21   1.043152  0.771189
22   0.349311 -0.126965
23   0.583339 -0.399312
24  -1.137595 -0.608829
25   0.076376  0.895939
26   1.701080 -0.259838
27  -0.512599 -1.597407
28   1.466873  1.473203
29   1.816235 -1.165155
..        ...       ...
970 -0.549648  0.221114
971  0.929773 -0.792029
972 -0.413279  0.503107
973  0.021332  0.270547
974 -0.342921  0.748245
975  0.112782 -1.676471
976  0.364569  1.249794
977 -0.070230 -0.881168
978 -0.584153  1.050167
979 -0.216380  1.439248
980  0.931232  0.742997
981 -0.335562  0.187201
982  0.533332  0.244849
983  1.189090  0.547121
984 -0.380207 -0.350475
985 -1.278659 -2.081906
986 -0.361327 -0.093145
987  0.426397 -0.579971
988 -0.466909 -0.583967
989  0.459606  0.315952
990 -1.447924 -0.589308
991 -0.454075  1.219349
992 -1.094397  0.017708
993 -0.487363  0.752421
994  1.260531 -0.897276
995  1.065157 -0.206752
996 -0.872711 -0.844928
997  0.012272 -0.015807
998 -1.570993  2.535790
999  0.305149 -1.254552

[1000 rows x 2 columns]

In [93]:
quartiles = pd.cut(frame.data1,4)

In [94]:
quartiles[:10]

0     (-1.45, 0.229]
1     (-1.45, 0.229]
2     (0.229, 1.908]
3     (0.229, 1.908]
4     (0.229, 1.908]
5     (-1.45, 0.229]
6    (-3.136, -1.45]
7     (-1.45, 0.229]
8     (0.229, 1.908]
9     (0.229, 1.908]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.136, -1.45] < (-1.45, 0.229] < (0.229, 1.908] < (1.908, 3.587]]

In [96]:
def get_stats(group):
    return {'min':group.min(), 'max':group.max(), 'count':group.count(), 'mean':group.mean()}

grouped = frame.data2.groupby(quartiles)

In [97]:
grouped.apply(get_stats).unstack()

                 count       max      mean       min
data1
(-3.136, -1.45]   71.0  2.535790 -0.071657 -2.595567
(-1.45, 0.229]   528.0  2.790656 -0.012708 -3.634433
(0.229, 1.908]   372.0  2.823974 -0.000380 -2.669273
(1.908, 3.587]    29.0  2.938387  0.282608 -0.722106

In [98]:
grouping = pd.qcut(frame.data1,10,labels = False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.535790 -0.078516 -2.595567
1      100.0  2.790656  0.145615 -3.634433
2      100.0  2.219389  0.016073 -1.971212
3      100.0  2.352224  0.057911 -2.196144
4      100.0  2.305107 -0.210988 -2.164580
5      100.0  2.378079 -0.029419 -3.293212
6      100.0  2.424164 -0.187419 -2.632239
7      100.0  2.823974  0.056950 -2.477958
8      100.0  2.249393  0.038895 -2.669273
9      100.0  2.938387  0.153469 -1.949296

## 10.3.3 Example: Filling Missing Values with Group-Specific Values

In [99]:
s = pd.Series(np.random.randn(6))
s[::2] = np.nan
s

0         NaN
1   -1.602556
2         NaN
3   -0.179869
4         NaN
5    1.452576
dtype: float64

In [100]:
s.fillna(s.mean())

0   -0.109950
1   -1.602556
2   -0.109950
3   -0.179869
4   -0.109950
5    1.452576
dtype: float64

In [101]:
states = ['Ohio','New York','Vermont','Florida','Oregon','Nevada','California','Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.Series(np.random.randn(8), index = states)
data

Ohio          0.756682
New York     -0.036521
Vermont       1.047286
Florida      -0.228588
Oregon       -0.565685
Nevada        0.863440
California    0.570775
Idaho         0.657240
dtype: float64

In [102]:
data[['Vermont','Nevada','Idaho']] = np.nan
data

Ohio          0.756682
New York     -0.036521
Vermont            NaN
Florida      -0.228588
Oregon       -0.565685
Nevada             NaN
California    0.570775
Idaho              NaN
dtype: float64

In [103]:
data.groupby(group_key).mean()

East    0.163858
West    0.002545
dtype: float64

In [104]:
fill_mean = lambda g:g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio          0.756682
New York     -0.036521
Vermont       0.163858
Florida      -0.228588
Oregon       -0.565685
Nevada        0.002545
California    0.570775
Idaho         0.002545
dtype: float64

In [105]:
fill_values = {'East':0.5, 'West': -1}

fill_func = lambda g:g.fillna(fill_values[g.name])

data.groupby(group_key).apply(fill_func)

Ohio          0.756682
New York     -0.036521
Vermont       0.500000
Florida      -0.228588
Oregon       -0.565685
Nevada       -1.000000
California    0.570775
Idaho        -1.000000
dtype: float64

## 10.3.4 Example: Random Sampling and Permutation

In [107]:
suits = ['H','S','C','D']
card_val = (list(range(1,11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2,11)) + ['J','K','Q']
cards = []
for suit in ['H','S','C','D']:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index = cards)

In [108]:
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [109]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [110]:
def draw(deck, n = 5):
    return deck.sample(n)

draw(deck)

9S     9
9C     9
2H     2
JH    10
6S     6
dtype: int64

In [111]:
get_suit = lambda card:card[-1]
deck.groupby(get_suit).apply(draw, n = 2)

C  QC    10
   JC    10
D  9D     9
   5D     5
H  5H     5
   9H     9
S  8S     8
   JS    10
dtype: int64

In [112]:
deck.groupby(get_suit, group_keys = False).apply(draw, n = 2)

7C     7
3C     3
AD     1
JD    10
QH    10
KH    10
AS     1
6S     6
dtype: int64

## 10.3.5 Example: Group Weighted Average and Correlation

In [113]:
df = pd.DataFrame({'category':['a','a','a','a','b','b','b','b'],
                   'data':np.random.randn(8),
                   'weights':np.random.rand(8)})
df

  category      data   weights
0        a -1.782671  0.132675
1        a -1.227625  0.610907
2        a -0.485352  0.746235
3        a -1.714130  0.827892
4        b -0.953592  0.398365
5        b -0.992605  0.329749
6        b  1.093865  0.279337
7        b  0.564569  0.243615

In [114]:
grouped = df.groupby('category')

In [115]:
get_wavg = lambda g:np.average(g['data'], weights = g['weights'])
grouped.apply(get_wavg)

category
a   -1.194189
b   -0.211095
dtype: float64

In [117]:
close_px = pd.read_csv('/Users/boyuan/Desktop/OneDrive - Duke University/Data Science Box/Python/Python for data analysis 2nd/examples/stock_px_2.csv',
                       parse_dates = True,
                       index_col = 0)
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB

In [118]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [119]:
spx_corr = lambda x:x.corrwith(x['SPX'])
rets = close_px.pct_change().dropna()

In [120]:
get_year = lambda x:x.year
by_year = rets.groupby(get_year)
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [121]:
by_year.apply(lambda g:g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

## 10.3.6 Example: Group-Wise Linear Regression

In [124]:
import statsmodels.api as sm

def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y,X).fit()
    return result.params

In [125]:
by_year.apply(regress, 'AAPL',['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

# 10.4 Pivot Tables and Cross-Tabulation

In [130]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [126]:
tips.pivot_table(index = ['day','smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [131]:
tips.pivot_table(['tip_pct','size'],
                 index = ['time','day'],
                 columns = 'smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [132]:
tips.pivot_table(['tip_pct','size'],
                 index = ['time', 'day'],
                 columns = 'smoker',
                 margins = True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [133]:
tips.pivot_table('tip_pct', index = ['time','smoker'], columns = 'day', aggfunc = len,margins = True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [135]:
tips.pivot_table('tip_pct', index = ['time','smoker'], columns = 'day', aggfunc = 'mean',margins = True)

day                 Fri       Sat       Sun      Thur       All
time   smoker
Dinner No      0.139622  0.158048  0.160113  0.159744  0.158653
       Yes     0.165347  0.147906  0.187250       NaN  0.160828
Lunch  No      0.187735       NaN       NaN  0.160311  0.160920
       Yes     0.188937       NaN       NaN  0.163863  0.170404
All            0.169913  0.153152  0.166897  0.161276  0.160803

In [136]:
tips.pivot_table('tip_pct', index = ['time','size','smoker'], columns = 'day', aggfunc = 'mean', fill_value = 0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

## 10.4.1 Cross-Tabulations: Crosstab

In [138]:
data = pd.DataFrame({'Sample':[1,2,3,4,5,6,7,8,9,10],
                     'Nationality':['USA','Japan','USA','Japan','Japan','Japan','USA','USA','Japan','USA'],
                     'Handedness':['Right','Left','Right','Right','Left','Right','Right','Left','Right','Right']})
data

   Sample Nationality Handedness
0       1         USA      Right
1       2       Japan       Left
2       3         USA      Right
3       4       Japan      Right
4       5       Japan       Left
5       6       Japan      Right
6       7         USA      Right
7       8         USA       Left
8       9       Japan      Right
9      10         USA      Right

In [139]:
pd.crosstab(data.Nationality, data.Handedness, margins = True)

Handedness   Left  Right  All
Nationality
Japan           2      3    5
USA             1      4    5
All             3      7   10

In [141]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins = True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244

# 10.5 Conclusion